Repository: Pilsburgh/diamanda
Catalog: trunk/diamandas/translator/locale/*/LC_MESSAGES/django.po
Languages: pl

source: PO file for translation
pl: Plik PO tłumaczenia

source: Application name
pl: Nazwa Aplikacji

source: Description
pl: Opis

source: Language of Translation
pl: Język Tłumaczenia

source: Translator
pl: Tłumacz

source: Translation
pl: Tłumaczenie

source: Translations
pl: Tłumaczenia

source: Gettext Translation File Informations
pl: Informacje o pliku tłumaczeń Gettexta

source: This Page lists all translations. You can apply as a translator of files that doesn't have assigned other translators. <b>Do not translate files that have translator already!</b>
pl: Na tej stronie wylistowane są wszystkie tłumaczenia. Możesz zapisać się jako tłumacz niektórych z nich i przetłumaczyć załączone pliki. <b>NIE tłumacz plików mających już wybranego tłumacza!</b>. Przetłumaczone pliki wysyłaj na adres <a href="mailto:riklaunim@gmail.com">riklaunim@gmail.com</a>.

source: Application
pl: Aplikacja

source: Language
pl: Język

source: Percent Translated
pl: Postęp Tłumaczenia

source: Untranslated Entries
pl: Nieprzetłumaczone frazy

source: Fuzzy Entries
pl: Fuzzy Frazy

source: Translated Entries
pl: Przetłumaczone Frazy

source: None
pl: Brak

source: apply now
pl: zapisz się

source: Not Fully Transtated
pl: Nie przetłumaczony do końca

source: Full Translation
pl: Pełne tłumaczenie

source: Options
pl: Opcje

source: Main Page
pl: Strona Główna

source: What are Translations ?
pl: Co to są Tłumaczenia ?

source: Home
pl: Strona Główna

source: Translations List
pl: Lista Tłumaczeń

source: Translation Description
pl: Opis Tłumaczenia

source: Do you want to translate this file?
pl: Czy chcesz tłumaczyć ten plik?

source: Login to apply
pl: Musisz się zalogować

source: Comments
pl: Komentarze

source: Translations Forum
pl: Forum Tłumaczeń

source: Translations Main Page
pl: Tłumaczenia

source: Gettext Translations Manager
pl: Tłumaczenia Gettext
