Repository: Pilsburgh/diamanda
Catalog: trunk/diamandas/cbcplugins/locale/*/LC_MESSAGES/django.po
Languages: pl

source: [rk:art slug="SLUG_NAME"]
pl: [rk:art slug="Nazwa Odnośnika"]

source: Will insert a link to a given page (by the given slug) using it title and description
pl: Wstawi odnośnik do podanej strony używając jej tytułu i opisu

source: [rk:syntax lang="LANG"]CODE[/rk:syntax]
pl: [rk:syntax lang="JĘZYK"]KOD[/rk:syntax]

source: Will highlight the code using entered in the "lang" attribute scheme - python, xml, html, ruby, perl, lua, cpp, delphi, java, php, makefile, diff, javascript, css, sql.
pl: Podświetli kod bazując na języku podanym w atrybucie "lang". Możliwe opcje to - python, xml, html, ruby, perl, lua, cpp, delphi, java, php, makefile, diff, javascript, css, sql.

source: [rk:h id="1-4"]Title[/rk:h]
pl: [rk:h id="1-4"]Tytuł[/rk:h]

source: Will insert the given title in a H1-4 tag (as defined in the id attribute). Use this tags if you want to use Page Table of Contents generated by [toc]
pl: Wstawi podany "Tytuł" w tagu H1-4 wraz z zakładką używaną przez [toc]

source: [rk:topics forum="Forum_id"]
pl: [rk:topics forum="id_Forum"]

source: Will insert a list of 10 latest active topics from selected forum or from all forums if "forum attribute is set to 0.
pl: Wyświetli listę 10 ostatnich tematów z wybranego forum. By wyświetlić listę tematów ze wszystkich for wstaw 0 jako "forum"

source: [rk:thumb src="image.jpg"] [rk:thumb src="folder/image.jpg"]
pl: [rk:thumb src="grafa.jpg"] [rk:thumb src="folder/grafika.jpg"]

source: Will insert a link to a local image using a thumb and a pop-up. The thumb will be created by PIL. Images can be in SITE_IMAGES_DIR_PATH subfolders.
pl: Stworzy odnośnik do lokalnej grafiki z wykorzystaniem miniatury i popupa. Lokalne grafiki znajdują się w katalogu określonym przez SITE_IMAGES_DIR_PATH i jego podkatalogach.

source: Will insert a link to a local image using a thumb and lightbox JS widget. The thumb will be created by PIL. Images can be in SITE_IMAGES_DIR_PATH subfolders
pl: Stworzy odnośnik do lokalnej grafiki z wykorzystaniem miniatury i widżeta JS. Lokalne grafiki znajdują się w katalogu określonym przez SITE_IMAGES_DIR_PATH i jego podkatalogach.

source: [rk:table name="tablea" width="50%" sort="'N', 'S', 'S'"] field1|field2|fiel3 1|valuex|valuey 4|bar|text 2|tekx2|foo [/rk:table]
pl: [rk:table name="tabela" width="50%" sort="'N', 'S', 'S'"] pole1|pole2|pole3 1|valuex|valuey 4|bar|text 2|tekx2|foo [/rk:table]

source: Will insert a table with row highlighting and column sorting. name - unique name for each table on the page, width - optional, default 100%, sort - defines sorting rules, S - string, N - number - for each column. Between tags you place the table structure, using | as a column separator. First row is the table head, the rest is the table data.
pl: Wyświetli tabelę z podświetlanymi wierszami i sortowaniem kolumn (JS). Atrybut "name" to unikalny identyfikator tabelki. "sort" określa reguły sortowania - S - łańuch, N - liczba. Znak | oddziela kolumny, pierwsza kolumna jest nagłówkiem tabeli.

source: [rk:link href="URL" desc="DESCRIPTION"]TITLE[/rk:link]
pl: [rk:link href="URL" desc="OPIS"]TYTUŁ[/rk:link]

source: Will insert a external link with nice icon. "desc" attribute is optional and if added will display a description text by the link
pl: Wstawi odnośnik używając ikonki. Atrybut "desc" jest opcjonalny
